{
  "source_file": "/content/drive/MyDrive/disorders/Bipolar_and_Related_Disorders_out/SubSection1_Bipolar_I_Disorder.txt",
  "relative_path": "Bipolar_and_Related_Disorders_out/SubSection1_Bipolar_I_Disorder.txt",
  "html_page": "Bipolar_and_Related_Disorders_out/Bipolar_I_Disorder.html",
  "hierarchy": {
    "file_name": "SubSection1_Bipolar_I_Disorder.txt",
    "file_stem": "SubSection1_Bipolar_I_Disorder",
    "folders": [
      "Bipolar_and_Related_Disorders_out"
    ],
    "full_path": "Bipolar_and_Related_Disorders_out/SubSection1_Bipolar_I_Disorder.txt",
    "parsed_name": "SubSection1 Bipolar I Disorder",
    "location": "Bipolar_and_Related_Disorders_out > SubSection1_Bipolar_I_Disorder"
  },
  "total_word_count": 5690,
  "num_chunks": 7,
  "max_words_per_chunk": 1000,
  "overlap_words": 100,
  "embedding_model": "text-embedding-ada-002",
  "embedding_shape": [
    7,
    1536
  ],
  "chunks": [
    {
      "chunk_id": 0,
      "word_count": 1000,
      "text_preview": "Bipolar I Disorder Diagnostic Criteria For a diagnosis of bipolar I disorder, it is necessary to meet the following criteria for a manic episode. The manic episode may have been preceded by and may be..."
    },
    {
      "chunk_id": 1,
      "word_count": 1000,
      "text_preview": "day (observable by others, not merely subjective feelings of restlessness or being slowed down). 6. Fatigue or loss of energy nearly every day. 7. Feelings of worthlessness or excessive or inappropria..."
    },
    {
      "chunk_id": 2,
      "word_count": 1000,
      "text_preview": "shifts in mood over brief periods of time may occur and are referred to as lability (i.e., the alternation among euphoria, dysphoria, and irritability). In children, happiness, silliness, and “goofine..."
    },
    {
      "chunk_id": 3,
      "word_count": 1000,
      "text_preview": "The individual may purchase many unneeded items without the money to pay for them and, in some cases, give them away. Sexual indiscretions may include infidelity or indiscriminate sexual encounters wi..."
    },
    {
      "chunk_id": 4,
      "word_count": 1000,
      "text_preview": "and 47.3% without polarity predominance. The course of bipolar I disorder is highly heterogeneous. Some patterns have been noted across episodes (e.g., a manic episode with psychotic features may be a..."
    },
    {
      "chunk_id": 5,
      "word_count": 1000,
      "text_preview": "with both disorders are at greater risk for suicide attempt and suicide death. Functional Consequences of Bipolar I Disorder Approximately 30% of individuals with bipolar disorder show severe impairme..."
    },
    {
      "chunk_id": 6,
      "word_count": 290,
      "text_preview": "common in both conditions. In order to make a diagnosis of bipolar I disorder, symptoms of mood lability and impulsivity must represent a distinct episode of illness, or there must be a noticeable inc..."
    }
  ]
}